microchip-pic-avr-examples/dspic33ck-power-dcdc-dual-active-bridge-development-platform/dab-pwm-configuration.X/sources/driver_chiplayer/mcc_extenstion/drv_mcc_extension_pwm.h
    };
}

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_PCI_Sync_TerminateAfterEvent 
 * @brief   set TSYNCDIS bit to determine when PWM should stop after a sync event occurs
 * @details
 *  
 **********************************************************************************/
inline static void PWM_PCI_Sync_TimetoTerminateAfterEvent(PWM_GENERATOR_INSTANCE_t pwmIndex, PWM_PCI_TERMTIME_AFTER_EVENT_t faultTerm)
{
    switch (pwmIndex)
    {
        case 1:
            PG1SPCILbits.TSYNCDIS = faultTerm;
            break;
        case 2:
            PG2SPCILbits.TSYNCDIS = faultTerm;
            break;  
        case 3:
            PG3SPCILbits.TSYNCDIS = faultTerm;
            break;          
        case 4:
            PG4SPCILbits.TSYNCDIS = faultTerm;
            break;    
    #if (PWM_COUNT == 8)          
        case 5:
            PG5SPCILbits.TSYNCDIS = faultTerm;
            break;    
        case 6:
            PG6SPCILbits.TSYNCDIS = faultTerm;
            break;         
        case 7:
            PG7SPCILbits.TSYNCDIS = faultTerm;
            break;  
        case 8:
            PG8SPCILbits.TSYNCDIS = faultTerm;
            break;  
    #endif        
        default:
            break;
            
    };
}

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_SOCS_e 
 * @brief   settings for SOCS field
 * @details
 *  
 **********************************************************************************/
enum PWM_SOCS_e
{
    PWM_SOCS_SELF_TRIGGER = 0,
    PWM_SOCS_PG1_OR_PG5 = 1,
    PWM_SOCS_PG2_OR_PG6 = 2,
    PWM_SOCS_PG3_OR_PG7 = 3,
    PWM_SOCS_PG4_OR_PG8 = 4,
    PWM_SOCS_TRIG_OR_PCI_SYNC = 15
};
typedef enum PWM_SOCS_e PWM_SOCS_t;


/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_StartOfCycleTrigger 
 * @brief   set SOCS field to determine start of cycle trigger
 * @details
 *  
 **********************************************************************************/
inline static void PWM_StartOfCycleTrigger(PWM_GENERATOR_INSTANCE_t pwmIndex, PWM_SOCS_t triggerSource)
{
    switch (pwmIndex)
    {
        case 1:
            PG1CONHbits.SOCS = triggerSource;
            break;
        case 2:
            PG2CONHbits.SOCS = triggerSource;
            break;
        case 3:
            PG3CONHbits.SOCS = triggerSource;
            break;
        case 4:
            PG4CONHbits.SOCS = triggerSource;
            break;
    #if (PWM_COUNT == 8)          
        case 5:
            PG5CONHbits.SOCS = triggerSource;
            break;
        case 6:
            PG6CONHbits.SOCS = triggerSource;
            break;
        case 7:
            PG7CONHbits.SOCS = triggerSource;
            break;
        case 8:
            PG8CONHbits.SOCS = triggerSource;
            break;
    #endif        
        default:
            break;
    }
}       

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_StartOfCycleTrigger 
 * @brief  Enable broadcasting of UPDREQ bit to other PWMs 
 * @details
 * this is used for register update synchronization between PWMs
 * Setting the MSTEN bit means that the UPDREQ flag is broadcast to other PWMs
 * if the UPDMOD field in the receiving PWM is set to "Client SOC" or 
 * "client immediate" then this will
 * take effect and data update between different PWM modules can be implemented
 **********************************************************************************/
inline static void PWM_UPDREQ_Broadcast_Enable(PWM_GENERATOR_INSTANCE_t pwmIndex, bool enable)
{
    uint16_t enable_ = (uint16_t)enable;
    PG1CONHbits.MSTEN = enable_;
    
    switch (pwmIndex)
    {
        case 1:
            PG1CONHbits.MSTEN = enable_;
            break;
        case 2:
            PG2CONHbits.MSTEN = enable_;
            break;
        case 3:
            PG3CONHbits.MSTEN = enable_;
            break;
        case 4:
            PG4CONHbits.MSTEN = enable_;
            break;
    #if (PWM_COUNT == 8)         
        case 5:
            PG5CONHbits.MSTEN = enable_;
            break;
        case 6:
            PG6CONHbits.MSTEN = enable_;
            break;
        case 7:
            PG7CONHbits.MSTEN = enable_;
            break;
        case 8:
            PG8CONHbits.MSTEN = enable_;
            break;
    #endif        
        default:
            break;
    }
}

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_UPDMOD_e 
 * @brief  settings for UPDMOD field
 * @details
 *  
 **********************************************************************************/
enum PWM_UPDMOD_e
{
    PWM_UPDMOD_SOC = 0,
    PWM_UPDMOD_IMMEDIATE = 1,
    PWM_UPDMOD_CLIENT_SOC = 2,
    PWM_UPDMOD_CLIENT_IMMEDIATE = 3
};
typedef enum PWM_UPDMOD_e PWM_UPDMOD_t;

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_Data_Update_Mode(uint16_t pwmIndex, PWM_UPDMOD_t updateMode) 
 * @brief  Set PWM Register update mode
 * @details
 * this is used for register update synchronization between PWMs
 * Setting the MSTEN bit means that the UPDREQ flag is broadcast to other PWMs
 * if the UPDMOD field in the receiving PWM is set to "Client SOC" or 
 * "client immediate" then this will
 * take effect and data update between different PWM modules can be implemented
 **********************************************************************************/
inline static void PWM_Data_Update_Mode(PWM_GENERATOR_INSTANCE_t pwmIndex, PWM_UPDMOD_t updateMode)
{
    switch (pwmIndex)
    {
        case 1:
            PG1CONHbits.UPDMOD = updateMode;
            break;
        case 2:
            PG2CONHbits.UPDMOD = updateMode;
            break;
        case 3:
            PG3CONHbits.UPDMOD = updateMode;
            break;
        case 4:
            PG4CONHbits.UPDMOD = updateMode;
            break;
    #if (PWM_COUNT == 8)         
        case 5:
            PG5CONHbits.UPDMOD = updateMode;
            break;
        case 6:
            PG6CONHbits.UPDMOD = updateMode;
            break;
        case 7:
            PG7CONHbits.UPDMOD = updateMode;
            break;
        case 8:
            PG8CONHbits.UPDMOD = updateMode;
            break;
    #endif        
        default:
            break;            
    }
}

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_PCI_SOURCE_e 
 * @brief  settings for PWMPCI field in PGxLEBH register
 * @details
 *  
 **********************************************************************************/
enum PWM_PCI_SOURCE_e
{
    PWM_PCI_SOURCE_PWM1 = 0,
    PWM_PCI_SOURCE_PWM2 = 1,
    PWM_PCI_SOURCE_PWM3 = 2,
    PWM_PCI_SOURCE_PWM4 = 3,
    #if (PWM_COUNT == 8) 
    PWM_PCI_SOURCE_PWM5 = 4,
    PWM_PCI_SOURCE_PWM6 = 5,
    PWM_PCI_SOURCE_PWM7 = 6,
    PWM_PCI_SOURCE_PWM8 = 7    
    #endif
};
typedef enum PWM_PCI_SOURCE_e PWM_PCI_SOURCE_t;

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_PCI_Source1(uint16_t pwmIndex, PWM_PCI_SOURCE_t pciSource)
 * @brief  Set PWM source for PCI selection bits (for PCI source 1)
 * @details
 * The selected PWM Generator source does not affect the LEB counter. This source can be optionally 
 * used as a PCI input, PCI qualifier, PCI terminator or PCI terminator qualifier
 **********************************************************************************/
inline static void PWM_PCI_Source1(PWM_GENERATOR_INSTANCE_t pwmIndex, PWM_PCI_SOURCE_t pciSource)
{
    switch (pwmIndex)
    {
        case 1:
            PG1LEBHbits.PWMPCI = (uint16_t)pciSource;
            break;
        case 2:
            PG2LEBHbits.PWMPCI = (uint16_t)pciSource;
            break;
        case 3:
            PG3LEBHbits.PWMPCI = (uint16_t)pciSource;
            break;
        case 4:
            PG4LEBHbits.PWMPCI = (uint16_t)pciSource;
            break;
    #if (PWM_COUNT == 8) 
        case 5:
            PG5LEBHbits.PWMPCI = (uint16_t)pciSource;
            break;
        case 6:
            PG6LEBHbits.PWMPCI = (uint16_t)pciSource;
            break;
        case 7:
            PG7LEBHbits.PWMPCI = (uint16_t)pciSource;
            break;
        case 8:
            PG8LEBHbits.PWMPCI = (uint16_t)pciSource;
            break;      
    #endif        
        default:
            break;
    }
}

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    RPnR_SOURCE_e 
 * @brief  peripheral output for re-mappable pins
 * @details
 *  
 **********************************************************************************/
enum RPnR_SOURCE_e
{
    RPnR_SOURCE_DefaultPORT = 0, ///> RPn tied to Default Pin
    RPnR_SOURCE_U1TX 		= 1, ///> RPn tied to UART1 Transmit
    RPnR_SOURCE_U1RTS 		= 2, ///> RPn tied to UART1 Request-to-Send
    RPnR_SOURCE_U2TX 		= 3, ///> RPn tied to UART2 Transmit
    RPnR_SOURCE_U2RTS 		= 4, ///> RPn tied to UART2 Request-to-Send
    RPnR_SOURCE_SDO1 		= 5, ///> RPn tied to SPI1 Data Output
    RPnR_SOURCE_SCK1 		= 6, ///> RPn tied to SPI1 Clock Output
    RPnR_SOURCE_SS1 		= 7, ///> RPn tied to SPI1 Client Select
    RPnR_SOURCE_SDO2 		= 8, ///> RPn tied to SPI2 Data Output
    RPnR_SOURCE_SCK2 		= 9, ///> RPn tied to SPI2 Clock Output
    RPnR_SOURCE_SS2 		= 10, ///> RPn tied to SPI2 Client Select
    RPnR_SOURCE_SDO3 		= 11, ///> RPn tied to SPI3 Data Output
    RPnR_SOURCE_SCK3 		= 12, ///> RPn tied to SPI3 Clock Output
    RPnR_SOURCE_SS3 		= 13, ///> RPn tied to SPI3 Client Select
    RPnR_SOURCE_REFCLKO 	= 14, ///> RPn tied to Reference Clock Output
    RPnR_SOURCE_OCM1 		= 15, ///> RPn tied to SCCP1 Output 
    RPnR_SOURCE_OCM2 		= 16, ///> RPn tied to SCCP2 Output 
    RPnR_SOURCE_OCM3 		= 17, ///> RPn tied to SCCP3 Output 
    RPnR_SOURCE_OCM4 		= 18, ///> RPn tied to SCCP4 Output 
    RPnR_SOURCE_OCM5 		= 19, ///> RPn tied to SCCP5 Output 
    RPnR_SOURCE_OCM6 		= 20, ///> RPn tied to SCCP6 Output 
    RPnR_SOURCE_CAN1TX 		= 21, ///> RPn tied to CAN1 Transmit 
    RPnR_SOURCE_CMP1 		= 23, ///> RPn tied to Comparator 1 Output 
    RPnR_SOURCE_CMP2 		= 24, ///> RPn tied to Comparator 2 Output 
    RPnR_SOURCE_CMP3 		= 25, ///> RPn tied to Comparator 3 Output 
    RPnR_SOURCE_U3TX 		= 27, ///> RPn tied to UART3 Transmit
    RPnR_SOURCE_U3RTS 		= 28, ///> RPn tied to UART3 Request-to-Send
    RPnR_SOURCE_PWM4H 		= 34, ///> RPn tied to PWM4H Output 
    RPnR_SOURCE_PWM4L 		= 35, ///> RPn tied to PWM4L Output 
    RPnR_SOURCE_PWMEA 		= 36, ///> RPn tied to PWM Event A Output 
    RPnR_SOURCE_PWMEB 		= 37, ///> RPn tied to PWM Event B Output 
    RPnR_SOURCE_QEICMP1 	= 38, ///> RPn tied to QEI1 Comparator Output
    RPnR_SOURCE_QEICMP2 	= 39, ///> RPn tied to QEI2 Comparator Output
    RPnR_SOURCE_CLC1OUT 	= 40, ///> RPn tied to CLC1 Output 
    RPnR_SOURCE_CLC2OUT 	= 41, ///> RPn tied to CLC2 Output 
    RPnR_SOURCE_OCM7 		= 42, ///> RPn tied to SCCP7 Output 
    RPnR_SOURCE_OCM8 		= 43, ///> RPn tied to SCCP8 Output 
    RPnR_SOURCE_PWMEC 		= 44, ///> RPn tied to PWM Event C Output 
    RPnR_SOURCE_PWMED 		= 45, ///> RPn tied to PWM Event D Output 
    RPnR_SOURCE_PTGTRG24 	= 46, ///> PTG Trigger Output 24
    RPnR_SOURCE_PTGTRG25 	= 47, ///> PTG Trigger Output 25
    RPnR_SOURCE_SENT1OUT 	= 48, ///> RPn tied to SENT1 Output 
    RPnR_SOURCE_SENT2OUT	= 49, ///> RPn tied to SENT2 Output
    RPnR_SOURCE_MCCP9A 		= 50, ///> RPn tied to MCCP9 Output A
    RPnR_SOURCE_MCCP9B 		= 51, ///> RPn tied to MCCP9 Output B
    RPnR_SOURCE_MCCP9C 		= 52, ///> RPn tied to MCCP9 Output C
    RPnR_SOURCE_MCCP9D 		= 53, ///> RPn tied to MCCP9 Output D
    RPnR_SOURCE_MCCP9E 		= 54, ///> RPn tied to MCCP9 Output E
    RPnR_SOURCE_MCCP9F 		= 55, ///> RPn tied to MCCP9 Output F
    RPnR_SOURCE_CLC3OUT 	= 59, ///> RPn tied to CLC4 Output
    RPnR_SOURCE_CLC4OUT 	= 60, ///> RPn tied to CLC4 Output
    RPnR_SOURCE_U1DTR 		= 61, ///> RPn tied to UART1 DTR
    RPnR_SOURCE_U2DTR 		= 62, ///> RPn tied to UART2 DTR
    RPnR_SOURCE_U3DTR 		= 63 ///> RPn tied to UART3 DTR        
};
typedef enum RPnR_SOURCE_e RPnR_SOURCE_t;


/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    RPnR_VIRTUAL_PIN_e 
 * @brief  list of re-mappable pins for dsPIC33CK256MP508
 * @details
 *  
 **********************************************************************************/
enum RPnR_VIRTUAL_PIN_e
{
    RPnR_VIRTUAL_PIN_RP176 = 0,
    RPnR_VIRTUAL_PIN_RP177 = 1,
    RPnR_VIRTUAL_PIN_RP178 = 2,
    RPnR_VIRTUAL_PIN_RP179 = 3,
    RPnR_VIRTUAL_PIN_RP180 = 4,
    RPnR_VIRTUAL_PIN_RP181 = 5
};
typedef enum RPnR_VIRTUAL_PIN_e RPnR_VIRTUAL_PIN_t;

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    RPnR_VirtualPin_Source(RPnR_VIRTUAL_PIN_t pin, RPnR_SOURCE_t peripheral)
 * @brief  Set source for a virtual pin
 * @details
 * These pins provide a simple way for inter-peripheral
 * connection without utilizing a physical pin. For
 * example, the output of the analog comparator can be
 * connected to RP176 and the PWM Fault input can be
 * configured for RP176 as well. This configuration allows
 * the analog comparator to trigger PWM Faults without
 * the use of an actual physical pin on the device
 **********************************************************************************/
inline static void RPnR_VirtualPin_Source(RPnR_VIRTUAL_PIN_t virtualPin, RPnR_SOURCE_t peripheral)
{
    
