microchip-pic-avr-examples/dspic33ck-power-dcdc-dual-active-bridge-development-platform/dab-pwm-configuration.X/sources/driver_chiplayer/mcc_extenstion/drv_mcc_extension_pwm.h
    __builtin_write_RPCON(0x0000); // unlock PPS
    
    switch (virtualPin)
    {
        case RPnR_VIRTUAL_PIN_RP176:
            RPOR24bits.RP176R = peripheral;
            break;
           
        case RPnR_VIRTUAL_PIN_RP177:
            RPOR24bits.RP177R = peripheral;
            break;
        
        case RPnR_VIRTUAL_PIN_RP178:
            RPOR25bits.RP178R = peripheral;
            break;
            
        case RPnR_VIRTUAL_PIN_RP179:
            RPOR25bits.RP179R = peripheral;
            break;    
            
        case RPnR_VIRTUAL_PIN_RP180:
            RPOR26bits.RP180R = peripheral;
            break;    

        case RPnR_VIRTUAL_PIN_RP181:
            RPOR26bits.RP181R = peripheral;
            break;                   
        
        default:
            break;
    };
    
    __builtin_write_RPCON(0x0800); // lock PPS
}

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    RPx_INPUT_e 
 * @brief  list of output selection for re-mappable pins (taken from dsPIC33CK256MP508 datasheet)
 * @details
 *  
 **********************************************************************************/
enum RPx_INPUT_e
{
    RPx_INPUT_VSS					= 0, ///> Internal
    RPx_INPUT_CMP1 					= 1, ///> Internal 
    RPx_INPUT_CMP2 					= 2, ///> Internal 
    RPx_INPUT_CMP3 					= 3, ///> Internal 
    RPx_INPUT_PTG_TRIG_26 			= 6, ///> Internal 
    RPx_INPUT_PTG_TRIG_27 			= 7, ///> Internal 
    RPx_INPUT_PWM_EVENT_C 			= 11, ///> Internal 
    RPx_INPUT_PWM_EVENT_D 			= 12, ///> Internal 
    RPx_INPUT_PWM_EVENT_E 			= 13, ///> Internal 
    RPx_INPUT_RP32 					= 32, ///> Port Pin RB0
    RPx_INPUT_RP33 					= 33, ///> Port Pin RB1
    RPx_INPUT_RP34 					= 34, ///> Port Pin RB2
    RPx_INPUT_RP35 					= 35, ///> Port Pin RB3
    RPx_INPUT_RP36 					= 36, ///> Port Pin RB4
    RPx_INPUT_RP37 					= 37, ///> Port Pin RB5
    RPx_INPUT_RP38 					= 38, ///> Port Pin RB6
    RPx_INPUT_RP39 					= 39, ///> Port Pin RB7
    RPx_INPUT_RP40 					= 40, ///> Port Pin RB8
    RPx_INPUT_RP41 					= 41, ///> Port Pin RB9
    RPx_INPUT_RP42 					= 42, ///> Port Pin RB10
    RPx_INPUT_RP43 					= 43, ///> Port Pin RB11
    RPx_INPUT_RP44 					= 44, ///> Port Pin RB12
    RPx_INPUT_RP45 					= 45, ///> Port Pin RB13
    RPx_INPUT_RP46 					= 46, ///> Port Pin RB14
    RPx_INPUT_RP47 					= 47, ///> Port Pin RB15
    RPx_INPUT_RP48 					= 48, ///> Port Pin RC0
    RPx_INPUT_RP49 					= 49, ///> Port Pin RC1
    RPx_INPUT_RP50 					= 50, ///> Port Pin RC2
    RPx_INPUT_RP51 					= 51, ///> Port Pin RC3
    RPx_INPUT_RP52 					= 52, ///> Port Pin RC4
    RPx_INPUT_RP53 					= 53, ///> Port Pin RC5
    RPx_INPUT_RP54 					= 54, ///> Port Pin RC6
    RPx_INPUT_RP55 					= 55, ///> Port Pin RC7
    RPx_INPUT_RP56 					= 56, ///> Port Pin RC8
    RPx_INPUT_RP57 					= 57, ///> Port Pin RC9
    RPx_INPUT_RP58 					= 58, ///> Port Pin RC10
    RPx_INPUT_RP59 					= 59, ///> Port Pin RC11
    RPx_INPUT_RP60 					= 60, ///> Port Pin RC12
    RPx_INPUT_RP61 					= 61, ///> Port Pin RC13
    RPx_INPUT_RP62 					= 62, ///> Port Pin RC14
    RPx_INPUT_RP63 					= 63, ///> Port Pin RC15
    RPx_INPUT_RP64 					= 64, ///> Port Pin RD0
    RPx_INPUT_RP65 					= 65, ///> Port Pin RD1
    RPx_INPUT_RP66 					= 66, ///> Port Pin RD2
    RPx_INPUT_RP67 					= 67, ///> Port Pin RD3
    RPx_INPUT_RP68 					= 68, ///> Port Pin RD4
    RPx_INPUT_RP69 					= 69, ///> Port Pin RD5
    RPx_INPUT_RP70 					= 70, ///> Port Pin RD6
    RPx_INPUT_RP71 					= 71, ///> Port Pin RD7
    RPx_INPUT_RP72 					= 72, ///> Port Pin RD8
    RPx_INPUT_RP73 					= 73, ///> Port Pin RD9
    RPx_INPUT_RP74 					= 74, ///> Port Pin RD10
    RPx_INPUT_RP75 					= 75, ///> Port Pin RD11
    RPx_INPUT_RP76 					= 76, ///> Port Pin RD12
    RPx_INPUT_RP77 					= 77, ///> Port Pin RD13
    RPx_INPUT_RP78 					= 78, ///> Port Pin RD14
    RPx_INPUT_RP79 					= 79, ///> Port Pin RD15
    RPx_INPUT_DAC3_pwm_req_on 		= 164, ///> Internal
    RPx_INPUT_DAC3_pwm_req_off 		= 165, ///> Internal
    RPx_INPUT_DAC2_pwm_req_on 		= 166, ///> Internal
    RPx_INPUT_DAC2_pwm_req_off 		= 167, ///> Internal
    RPx_INPUT_DAC1_pwm_req_on 		= 168, ///> Internal
    RPx_INPUT_DAC1_pwm_req_off 		= 169, ///> Internal
    RPx_INPUT_RP176 				= 176, ///> Virtual RPV0
    RPx_INPUT_RP177 				= 177, ///> Virtual RPV1
    RPx_INPUT_RP178 				= 178, ///> Virtual RPV2
    RPx_INPUT_RP179 				= 179, ///> Virtual RPV3
    RPx_INPUT_RP180 				= 180, ///> Virtual RPV4
    RPx_INPUT_RP181 				= 181  ///> Virtual RPV5
};
typedef enum RPx_INPUT_e RPx_INPUT_t;

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_PCI_INPUT_e 
 * @brief  list of PWM PCI inputs
 * @details
 *  
 **********************************************************************************/
enum PWM_PCI_INPUT_e
{
    PWM_PCI_INPUT8 = 0,
    PWM_PCI_INPUT9 = 1,
    PWM_PCI_INPUT10 = 2,
    PWM_PCI_INPUT11 = 3
};
typedef enum PWM_PCI_INPUT_e PWM_PCI_INPUT_t;

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_PCI_MaptoPin(PWM_PCI_INPUT_t pciIndex, RPx_INPUT_t pin)
 * @brief  Map PWM PCI input to a pin
 * @details
 * details taken from dsPIC33CK256MP508 datasheet
 **********************************************************************************/
inline static void PWM_PCI_INPUT_MaptoPin(PWM_PCI_INPUT_t pciIndex, RPx_INPUT_t pin)
{
    __builtin_write_RPCON(0x0000); // unlock PPS
    switch (pciIndex)
    {
        case PWM_PCI_INPUT8:
            RPINR12bits.PCI8R = pin;
            break;
            
        case PWM_PCI_INPUT9:
            RPINR12bits.PCI9R = pin;
            break;

        case PWM_PCI_INPUT10:
            RPINR13bits.PCI10R = pin;
            break;

        case PWM_PCI_INPUT11:
            RPINR13bits.PCI11R = pin;
            break;            
            
        default:
            break;            
    };
    __builtin_write_RPCON(0x0800); // lock PPS
}

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_PCI_INPUT_e 
 * @brief  list of PWM PCI inputs
 * @details
 *  
 **********************************************************************************/
enum PWM_PCI_SOURCE_SELECT_e
{
    PWM_PCI_SOURCE_SELECT_CLC1 		   = 31,
    // 30 is reserved           
    PWM_PCI_SOURCE_SELECT_CMP3         = 29,
    PWM_PCI_SOURCE_SELECT_CMP2         = 28,
    PWM_PCI_SOURCE_SELECT_CMP1         = 27,
    PWM_PCI_SOURCE_SELECT_PWM_EVENT_D  = 26,
    PWM_PCI_SOURCE_SELECT_PWM_EVENT_C  = 25,
    PWM_PCI_SOURCE_SELECT_PWM_EVENT_B  = 24,
    PWM_PCI_SOURCE_SELECT_PWM_EVENT_A  = 23,
    PWM_PCI_SOURCE_SELECT_PCI22		   = 22,	///> device pin
    PWM_PCI_SOURCE_SELECT_PCI21		   = 21,	///> device pin
    PWM_PCI_SOURCE_SELECT_PCI20		   = 20,	///> device pin
    PWM_PCI_SOURCE_SELECT_PCI19		   = 19,	///> device pin
    PWM_PCI_SOURCE_SELECT_PCI18R	   = 18,	///> RPn input
    PWM_PCI_SOURCE_SELECT_PCI17R	   = 17,	///> RPn input
    PWM_PCI_SOURCE_SELECT_PCI16R	   = 16,	///> RPn input
    PWM_PCI_SOURCE_SELECT_PCI15R 	   = 15,	///> RPn input
    PWM_PCI_SOURCE_SELECT_PCI14R 	   = 14,	///> RPn input
    PWM_PCI_SOURCE_SELECT_PCI13R       = 13,	///> RPn input
    PWM_PCI_SOURCE_SELECT_PCI12R       = 12,	///> RPn input
    PWM_PCI_SOURCE_SELECT_PCI11R       = 11,	///> RPn input
    PWM_PCI_SOURCE_SELECT_PCI10R	   = 10,	///> RPn input
    PWM_PCI_SOURCE_SELECT_PCI9R        = 9,	    ///> RPn input
    PWM_PCI_SOURCE_SELECT_PCI8R        = 8,
    // 7 is reserved,           
    // 6 is reserved,           
    // 5 is reserved,           
    // 4 is reserved,           
    PWM_PCI_SOURCE_SELECT_COMBO_TRIG_B = 3,
    PWM_PCI_SOURCE_SELECT_COMBO_TRIG_A = 2,
    PWM_PCI_SOURCE_SELECT_PWMPCI_MUX   = 1,
    PWM_PCI_SOURCE_SELECT_TIED_TO_0    = 0
};

typedef enum PWM_PCI_SOURCE_SELECT_e PWM_PCI_SOURCE_SELECT_t;

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_PCI_Sync_Source_Select(uint16_t pwmIndex, PWM_PCI_SOURCE_SELECT_t source)
 * @brief  set PCI source (PSS field) for PCI sync
 * @details
 **********************************************************************************/
inline static void PWM_PCI_Sync_Source_Select(PWM_GENERATOR_INSTANCE_t pwmIndex, PWM_PCI_SOURCE_SELECT_t pciSource)
{
    switch (pwmIndex)
    {
        case 1:
            PG1SPCILbits.PSS = pciSource;
            break;
        case 2:
            PG2SPCILbits.PSS = pciSource;
            break;
        case 3:
            PG3SPCILbits.PSS = pciSource;
            break;
        case 4:
            PG4SPCILbits.PSS = pciSource;
            break;
    #if (PWM_COUNT == 8) 
        case 5:
            PG5SPCILbits.PSS = pciSource;
            break;
        case 6:
            PG6SPCILbits.PSS = pciSource;
            break;
        case 7:
            PG7SPCILbits.PSS = pciSource;
            break;      
        case 8:
            PG8SPCILbits.PSS = pciSource;
            break;  
    #endif        
        default:
            break;
    };
}


/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_PCI_ACCEPTANCE_QUALIFER_e 
 * @brief  list of sources of PWM acceptance qualifers
 * @details
 *  
 **********************************************************************************/
enum PWM_PCI_ACCEPTANCE_QUALIFER_e
{
    PWM_PCI_ACCEPTANCE_QUALIFER_NONE = 0, ///> No acceptance qualifier is used (qualifier forced to ?1?)
    PWM_PCI_ACCEPTANCE_QUALIFER_DUTY = 1, ///> Duty cycle is active (base PWM Generator signal)
    PWM_PCI_ACCEPTANCE_QUALIFER_LEB = 2, ///> LEB is active
    PWM_PCI_ACCEPTANCE_QUALIFER_PWM = 3, ///> PWM Generator is triggered
    PWM_PCI_ACCEPTANCE_QUALIFER_PCI_PWMPCI = 4, ///> Selects PCI Source #1 (PWM Generator output selected by the PWMPCI[2:0] bits)
    PWM_PCI_ACCEPTANCE_QUALIFER_PCI_SOURCE8 = 5, ///> Selects PCI Source #8
    PWM_PCI_ACCEPTANCE_QUALIFER_PCI_SOURCE9 = 6, ///> Selects PCI Source #9
    PWM_PCI_ACCEPTANCE_QUALIFER_SWPCI = 7 ///> SWPCI control bit only (qualifier forced to ?0?)
};
typedef enum PWM_PCI_ACCEPTANCE_QUALIFER_e PWM_PCI_ACCEPTANCE_QUALIFER_t;


/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_PCI_Fault_AcceptanceQualifierSource(uint16_t pwmIndex, PWM_PCI_ACCEPTANCE_QUALIFER_e source)
 * @brief  set source of fault PCI acceptance qualifier
 * @details
 **********************************************************************************/
inline static void PWM_PCI_Fault_AcceptanceQualifierSource(PWM_GENERATOR_INSTANCE_t pwmIndex, PWM_PCI_ACCEPTANCE_QUALIFER_t source)
{
    switch (pwmIndex)
    {
        case 1:
            PG1FPCILbits.AQSS = source;
            break;
        case 2:
            PG2FPCILbits.AQSS = source;
            break;
        case 3:
            PG3FPCILbits.AQSS = source;
            break;
        case 4:
            PG4FPCILbits.AQSS = source;
            break;
    #if (PWM_COUNT == 8)         
        case 5:
            PG5FPCILbits.AQSS = source;
            break;
        case 6:
            PG6FPCILbits.AQSS = source;
            break;
        case 7:
            PG7FPCILbits.AQSS = source;
            break;
        case 8:
            PG8FPCILbits.AQSS = source;
            break;      
    #endif        
        default:
            break;
    };
}

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_TRIG_MODE_e 
 * @brief  set PWM trigger mode
 * @details
 * TRGNOD field
 **********************************************************************************/
enum PWM_TRIG_MODE_e
{
    PWM_TRIG_MODE_SINGLE = 0,
    PWM_TRIG_MODE_RETRIGGERABLE = 1
};
typedef enum PWM_TRIG_MODE_e PWM_TRIG_MODE_t;

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_PCI_Fault_AcceptanceQualifierSource(uint16_t pwmIndex, PWM_PCI_ACCEPTANCE_QUALIFER_e source)
 * @brief  set source of fault PCI acceptance qualifier
 * @details
 **********************************************************************************/
inline static void PWM_Trigger_Mode(PWM_GENERATOR_INSTANCE_t pwmIndex, PWM_TRIG_MODE_t trigMode)
{
    switch (pwmIndex)
    {
        case 1:
            PG1CONHbits.TRGMOD = trigMode;
            break;
        case 2:
            PG2CONHbits.TRGMOD = trigMode;
            break;
        case 3:
            PG3CONHbits.TRGMOD = trigMode;
            break;
        case 4:
            PG4CONHbits.TRGMOD = trigMode;
            break;
    #if (PWM_COUNT == 8)         
        case 5:
            PG5CONHbits.TRGMOD = trigMode;
            break;
        case 6:
            PG6CONHbits.TRGMOD = trigMode;
            break;
        case 7:
            PG7CONHbits.TRGMOD = trigMode;
            break;
        case 8:
            PG8CONHbits.TRGMOD = trigMode;
            break;   
    #endif        
        default:
            break;
    };
}

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_PCI_TERM_e 
 * @brief  termination event selection 
 * @details
 **********************************************************************************/
enum PWM_PCI_TERM_e
{
    PWM_PCI_TERM_MANUAL		= 0,	//> Manual Terminate: Terminate on a write of ?1? to the SWTERM bit location
    PWM_PCI_TERM_AUTO 		= 1,    //> Auto-Terminate: Terminate when PCI source transitions from active to inactive
    PWM_PCI_TERM_PGxTRIGA	= 2,    //> PGxTRIGA trigger event
    PWM_PCI_TERM_PGxTRIGB   = 3,    //> PGxTRIGB trigger event
    PWM_PCI_TERM_PGxTRIGC   = 4,    //> PGxTRIGC trigger event
    PWM_PCI_TERM_PCI_SOURCE1 = 5,   //> Selects PCI Source #1 (PWM Generator output selected by the PWMPCI[2:0] bits)
    PWM_PCI_TERM_PCI_SOURCE8 = 6,   //> Selects PCI Source #8
    PWM_PCI_TERM_PCI_SOURCE9 = 7    //> Selects PCI Source #9
};
