microchip-pic-avr-examples/dspic33ck-power-dcdc-dual-active-bridge-development-platform/dab-pwm-configuration.X/sources/driver_chiplayer/mcc_extenstion/drv_mcc_extension_pwm.h
typedef enum PWM_PCI_TERM_e PWM_PCI_TERM_t;

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_PCI_Sync_TerminationEventSelect(uint16_t pwmIndex, PWM_PCI_TERM_t trigMode)
 * @brief  select termination event for SYNC PCI
 * @details
 **********************************************************************************/
inline static void PWM_PCI_Sync_TerminationEventSelect(PWM_GENERATOR_INSTANCE_t pwmIndex, PWM_PCI_TERM_t termEvent)
{
    switch (pwmIndex)
    {
        case 1:
            PG1SPCILbits.TERM = termEvent;
            break;
        case 2:
            PG2SPCILbits.TERM = termEvent;
            break;
        case 3:
            PG3SPCILbits.TERM = termEvent;
            break;
        case 4:
            PG4SPCILbits.TERM = termEvent;
            break;
    #if (PWM_COUNT == 8)         
        case 5:
            PG5SPCILbits.TERM = termEvent;
            break;
        case 6:
            PG6SPCILbits.TERM = termEvent;
            break;
        case 7:
            PG7SPCILbits.TERM = termEvent;
            break;
        case 8:
            PG8SPCILbits.TERM = termEvent;
            break;       
    #endif        
        default:
            break;
    };
}

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_Swap_PWMxL_and_PWMxH(uint16_t pwmIndex, bool swap)
 * @brief  set swapPWMH_PWML to true to swap PWML and PWMH
 * @details
 **********************************************************************************/
inline static void PWM_Swap_PWMxL_and_PWMxH(PWM_GENERATOR_INSTANCE_t pwmIndex, bool swapPWMH_PWML)
{
    switch (pwmIndex)
    {
        case 1:
            PG1IOCONLbits.SWAP = swapPWMH_PWML;
            break;
        case 2:
            PG2IOCONLbits.SWAP = swapPWMH_PWML;
            break;
        case 3:
            PG3IOCONLbits.SWAP = swapPWMH_PWML;
            break;
        case 4:
            PG4IOCONLbits.SWAP = swapPWMH_PWML;
            break;
    #if (PWM_COUNT == 8)         
        case 5:
            PG5IOCONLbits.SWAP = swapPWMH_PWML;
            break;
        case 6:
            PG6IOCONLbits.SWAP = swapPWMH_PWML;
            break;
        case 7:
            PG7IOCONLbits.SWAP = swapPWMH_PWML;
            break;
        case 8:
            PG8IOCONLbits.SWAP = swapPWMH_PWML;
            break;     
    #endif        
        default:
            break;
    };
}

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_EVENT_SOURCE_e 
 * @brief  select event source for PWMEVTx register
 * @details
 **********************************************************************************/
enum PWM_EVENT_SOURCE_e
{
    PWM_EVENT_SOURCE_PGTRGSEL = 0,
    PWM_EVENT_SOURCE_PWM_GEN_OUTPUT = 1,
    PWM_EVENT_SOURCE_PCI_SYNC_ACTIVE = 2,
    PWM_EVENT_SOURCE_PCI_FF_ACTIVE = 3,
    PWM_EVENT_SOURCE_PCI_FF_CL_ACTIVE = 4,
    PWM_EVENT_SOURCE_PCI_FAULT_ACTIVE = 5,
    PWM_EVENT_SOURCE_CAHALF = 6,
    PWM_EVENT_SOURCE_STEER = 7,
    PWM_EVENT_SOURCE_ADC_TRIG1 = 8,
    PWM_EVENT_SOURCE_ADC_TRIG2 = 9,
    PWM_EVENT_SOURCE_HR_ERROR_EVENT = 15
};
typedef enum PWM_EVENT_SOURCE_e PWM_EVENT_SOURCE_t;


/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_EVENTA_Configure
 * @brief  Configure Event A register
 * @details
 **********************************************************************************/
inline static void PWM_EVENTA_Configure(  PWM_GENERATOR_INSTANCE_t pwmSource, 
                                          PWM_EVENT_SOURCE_t eventSource,
                                          bool invert,
                                          bool outputEnable,
                                          bool stretchDisable,
                                          bool outputSync)
{
    {        
        PWMEVTAbits.EVTAPGS = (pwmSource-1);
        PWMEVTAbits.EVTAOEN = outputEnable;
        PWMEVTAbits.EVTAPOL = invert;
        PWMEVTAbits.EVTASTRD = stretchDisable;
        PWMEVTAbits.EVTASYNC = outputSync;
        PWMEVTAbits.EVTASEL = eventSource;        
    };
}

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_UPD_TRIG_e 
 * @brief  settings for UPDTRG field
 * @details
 *  
 **********************************************************************************/
enum PWM_UPDTRG_e
{
    PWM_UPDTRG_MANUAL = 0,      ///> user must manual set UPDREQ bit to update
    PWM_UPDTRG_PGxDC = 1,       ///> a write to PGxDC will update
    PWM_UPDTRG_PGxPHASE = 2,    ///> a write to PGxPHASE will update
    PWM_UPDTRG_PGxTRIGA = 3     ///> a write to PGxTRIGA will update
};
typedef enum PWM_UPDTRG_e PWM_UPDTRG_t;

/*********************************************************************************
 * @ingroup GROUP_NAME
 * @def    PWM_Data_Update_Trigger(uint16_t pwmIndex, PWM_UPDTRG_t updateTrigger) 
 * @brief  Set PWM Register update trigger
 * @details
 **********************************************************************************/
inline static void PWM_Data_Update_Trigger(uint16_t pwmIndex, PWM_UPDTRG_t updateTrigger)
{
    switch (pwmIndex)
    {
        case 1:
            PG1EVTLbits.UPDTRG = (uint16_t)updateTrigger;
            break;
        case 2:
            PG2EVTLbits.UPDTRG = (uint16_t)updateTrigger;
            break;
        case 3:
            PG3EVTLbits.UPDTRG = (uint16_t)updateTrigger;
            break;
        case 4:
            PG4EVTLbits.UPDTRG = (uint16_t)updateTrigger;
            break;
    #if (PWM_COUNT == 8)         
        case 5:
            PG5EVTLbits.UPDTRG = (uint16_t)updateTrigger;
            break;
        case 6:
            PG6EVTLbits.UPDTRG = (uint16_t)updateTrigger;
            break;
        case 7:
            PG7EVTLbits.UPDTRG = (uint16_t)updateTrigger;
            break;       
        case 8:
            PG8EVTLbits.UPDTRG = (uint16_t)updateTrigger;
            break;   
    #endif        
        default:
            break;
    }
}
#endif
#endif	/* DRV_MCC_EXTENSION_PWM_H */

